Repository: Bhuvanesh-S03/counterfeit_detection
Catalog: drug_authentication/lib/l10n/app_*.arb
Languages: hi, ta

# appTitle
source: AuthentiChain
hi: ऑथेंटिचैन
ta: ஆதண்டிகைன்

# loginTab
source: Login
hi: लॉगिन
ta: உள்நுழைவு

# signUpTab
source: Sign Up
hi: साइन अप करें
ta: பதிவு

# emailLabel
source: Email
hi: ईमेल
ta: மின்னஞ்சல்

# passwordLabel
source: Password
hi: पासवर्ड
ta: கடவுச்சொல்

# nameLabel
source: Name
hi: नाम
ta: பெயர்

# ageLabel
source: Age
hi: आयु
ta: வயது

# loginButton
source: Login
hi: लॉगिन
ta: உள்நுழைவு

# signUpButton
source: Sign Up
hi: साइन अप करें
ta: பதிவு

# fieldRequired
source: This field is required.
hi: यह फ़ील्ड आवश्यक है।
ta: இந்த புலம் கட்டாயம்.

# invalidEmail
source: Please enter a valid email.
hi: कृपया एक वैध ईमेल दर्ज करें।
ta: தயவுசெய்து சரியான மின்னஞ்சலை உள்ளிடவும்.

# invalidAge
source: Please enter a valid age.
hi: कृपया एक वैध आयु दर्ज करें।
ta: தயவுசெய்து சரியான வயதை உள்ளிடவும்.

# passwordLength
source: Password must be at least 6 characters long.
hi: पासवर्ड कम से कम 6 अक्षरों का होना चाहिए।
ta: கடவுச்சொல் குறைந்தபட்சம் 6 எழுத்துகள் இருக்க வேண்டும்.

source: Welcome!
hi: स्वागत है!
ta: வரவேற்பு!

# welcomeMessage
source: Welcome to AuthentiChain! Verify products with confidence.
hi: ऑथेंटिचैन में आपका स्वागत है! विश्वास के साथ उत्पादों को सत्यापित करें।
ta: ஆதண்டிகைன்க்கு வரவேற்கிறோம்! நம்பிக்கையுடன் பொருட்களை சரிபார்க்கவும்.

# customerRole
source: Verify Product
hi: उत्पाद सत्यापित करें
ta: பொருளைச் சரிபார்க்கவும்

# customerSubtitle
source: Check product authenticity.
hi: उत्पाद की प्रामाणिकता की जाँच करें।
ta: பொருளின் நம்பகத்தன்மையைச் சரிபார்க்கவும்.

# myProductsRole
source: My Products
hi: मेरे उत्पाद
ta: எனது பொருட்கள்

# myProductsSubtitle
source: View your scanned items.
hi: अपने स्कैन किए गए आइटम देखें।
ta: நீங்கள் ஸ்கேன் செய்த பொருட்களைப் பார்க்கவும்.

# verifyProductTitle
source: Verify Product Authenticity
hi: उत्पाद की प्रामाणिकता सत्यापित करें
ta: பொருள் நம்பகத்தன்மையைச் சரிபார்க்கவும்

# verifyProductMessage
source: Select the product image to check its details.
hi: विवरण की जांच करने के लिए उत्पाद छवि का चयन करें।
ta: விவரங்களைச் சரிபார்க்க படத்தைத் தேர்ந்தெடுக்கவும்.

# selectImageToVerifyButton
source: Select Product Image to Verify
hi: सत्यापित करने के लिए उत्पाद छवि चुनें
ta: சரிபார்க்க படத்தை தேர்ந்தெடுக்கவும்

# authenticProductTitle
source: ✅ Authentic Product
hi: ✅ प्रामाणिक उत्पाद
ta: ✅ உண்மையான பொருள்

# counterfeitProductTitle
source: ❌ Counterfeited Product!
hi: ❌ नकली उत्पाद!
ta: ❌ போலி பொருள்!

# counterfeitProductDetails
source: This product's image does not contain a valid hash or the hash is not on the blockchain.
hi: इस उत्पाद की छवि में एक वैध हैश नहीं है या हैश ब्लॉकचेन पर नहीं है।
ta: இந்த பொருளின் படத்தில் சரியான ஹாஷ் இல்லை அல்லது ஹாஷ் பிளாக்செயினில் இல்லை.

# verificationErrorTitle
source: Verification Error
hi: सत्यापन त्रुटि
ta: சரிபார்ப்புப் பிழை

# productIDLabel
source: Product ID
hi: उत्पाद आईडी
ta: பொருள் ஐடி

# expiryLabel
source: Expiry Date
hi: समाप्ति तिथि
ta: காலாவதி தேதி

# blockchainHashLabel
source: Blockchain Hash
hi: ब्लॉकचेन हैश
ta: பிளாக்செயின் ஹாஷ்

# saveProductButton
source: Save to My Products
hi: मेरे उत्पादों में सहेजें
ta: எனது பொருட்களில் சேமிக்கவும்

# verifyAnotherButton
source: Verify Another Product
hi: एक और उत्पाद सत्यापित करें
ta: மற்றொரு பொருளைச் சரிபார்க்கவும்

# saveProductSuccess
source: saved to your products!
hi: आपके उत्पादों में सहेजा गया!
ta: உங்கள் பொருட்களில் சேமிக்கப்பட்டது!

# saveProductFailure
source: Failed to save product
hi: उत्पाद सहेजने में विफल
ta: பொருளை சேமிக்க முடியவில்லை

# tryAgainButton
source: Try Again
hi: पुनः प्रयास करें
ta: மீண்டும் முயற்சிக்கவும்

source: Server error
hi: सर्वर त्रुटि
ta: சேவையகப் பிழை

# myProductsPageTitle
source: My Products
hi: मेरे उत्पाद
ta: எனது பொருட்கள்

# noProductsMessage
source: You have not scanned any products yet.
hi: आपने अभी तक कोई उत्पाद स्कैन नहीं किया है।
ta: நீங்கள் இன்னும் எந்த பொருட்களையும் ஸ்கேன் செய்யவில்லை.

# expiredOn
source: Expired on: {date}
hi: समाप्त: {date}
ta: காலாவதியானது: {date}

# expiresOn
source: Expires: {date}
hi: समाप्त होगा: {date}
ta: காலாவதியாகும்: {date}

# deleteButton
source: Delete
hi: मिटाएँ
ta: நீக்கு

# productDeleted
source: {productName} has been deleted.
hi: {productName} को हटा दिया गया है।
ta: {productName} நீக்கப்பட்டது.

source: Product Expiring Soon
hi: उत्पाद जल्द ही समाप्त हो रहा है
ta: பொருள் விரைவில் காலாவதியாகிறது

# expiryNotificationBody
source: Your product "{productName}" will expire on {expiryDate}.
hi: आपका उत्पाद "{productName}" {expiryDate} को समाप्त हो जाएगा।
ta: உங்கள் பொருள் "{productName}" {expiryDate} அன்று காலாவதியாகும்.

# failedToFetchDetails
source: Product found, but failed to fetch details.
hi: उत्पाद मिला, लेकिन विवरण लाने में विफल.
ta: பொருள் கண்டறியப்பட்டது, ஆனால் விவரங்களை எடுக்க முடியவில்லை.

# noWatermarkFound
source: No watermark found or image is too damaged.
hi: कोई वॉटरमार्क नहीं मिला या छवि बहुत क्षतिग्रस्त है।
ta: நீர்முத்திரை கண்டறியப்படவில்லை அல்லது படம் மிகவும் சேதமடைந்துள்ளது.

# watermarkInvalid
source: Watermark is invalid or product not found on blockchain.
hi: वॉटरमार्क अमान्य है या उत्पाद ब्लॉकचेन पर नहीं मिला है।
ta: நீர்முத்திரை செல்லாதது அல்லது பிளாக்செயினில் பொருள் கண்டறியப்படவில்லை.

# reportCounterfeitButton
source: Report Counterfeit
hi: नकली उत्पाद की रिपोर्ट करें
ta: போலி தயாரிப்பைப் புகாரளிக்கவும்

# reportCounterfeitSubtitle
source: Report a counterfeit or non-standard product
hi: नकली या गैर-मानक उत्पाद की रिपोर्ट करें
ta: போலி அல்லது தரமற்ற தயாரிப்பைப் புகாரளிக்கவும்

# reportProductTitle
source: Report Counterfeit Product
hi: नकली उत्पाद की रिपोर्ट करें
ta: போலி தயாரிப்பைப் புகாரளிக்கவும்

source: Tell Us More
hi: हमें और बताएं
ta: மேலும் சொல்லுங்கள்

# tellUsMoreDetails
source: Please provide details about why you are reporting this product. This helps us take appropriate action.
hi: कृपया इस बारे में विवरण प्रदान करें कि आप इस उत्पाद की रिपोर्ट क्यों कर रहे हैं। इससे हमें उचित कार्रवाई करने में मदद मिलती है।
ta: நீங்கள் ஏன் இந்தத் தயாரிப்பைப் புகாரளிக்கிறீர்கள் என்பது பற்றிய விவரங்களை வழங்கவும். இது பொருத்தமான நடவடிக்கை எடுக்க எங்களுக்கு உதவுகிறது.

# reportDetailsLabel
source: Your Report Details
hi: आपकी रिपोर्ट के विवरण
ta: உங்கள் புகார் விவரங்கள்

# reportDetailsHint
source: E.g., The packaging was damaged, the QR code was unreadable, the product looked fake, etc.
hi: उदा., पैकेजिंग क्षतिग्रस्त थी, क्यूआर कोड अपठनीय था, उत्पाद नकली लग रहा था, आदि।
ta: எ.கா., பேக்கேஜிங் சேதமடைந்துள்ளது, QR குறியீடு படிக்க முடியாதது, தயாரிப்பு போலியானது போல் தோன்றியது போன்றவை.

# submitReportButton
source: Submit Report
hi: रिपोर्ट सबमिट करें
ta: புகாரை சமர்ப்பி

# submittingReportButton
source: Submitting...
hi: सबमिट हो रहा है...
ta: சமர்ப்பிக்கிறது...

# cancelButton
source: Cancel
hi: रद्द करें
ta: ரத்துசெய்

# reportSuccess
source: Report submitted successfully.
hi: रिपोर्ट सफलतापूर्वक सबमिट की गई।
ta: புகார் வெற்றிகரமாக சமர்ப்பிக்கப்பட்டது.

# reportFailure
source: Failed to submit report.
hi: रिपोर्ट सबमिट करने में विफल।
ta: புகாரை சமர்ப்பிக்க முடியவில்லை.

# mustLoginToReport
source: You must be logged in to report a product.
hi: आपको किसी उत्पाद की रिपोर्ट करने के लिए लॉग इन करना होगा।
ta: ஒரு தயாரிப்பைப் புகாரளிக்க நீங்கள் உள்நுழைந்திருக்க வேண்டும்.

# reportProductPageTitle
source: Report Product
hi: उत्पाद रिपोर्ट
ta: தயாரிப்பு அறிக்கை

# productNameLabel
source: Product Name
hi: उत्पाद का नाम
ta: பொருள் பெயர்

# batchNumberLabel
source: Batch Number
hi: बैच संख्या
ta: தொகுதி எண்

# qcStatusLabel
source: QC Status
hi: गुणवत्ता नियंत्रण स्थिति
ta: தர கட்டுப்பாடு நிலை

# overallStatusLabel
source: Overall Status
hi: कुल स्थिति
ta: ஒட்டுமொத்த நிலை

source: Forgot Password?
hi: पासवर्ड भूल गए?
ta: கடவுச்சொல்லை மறந்துவிட்டீர்களா?

# emailRequiredForPasswordReset
source: Please enter your email to reset your password.
hi: अपना पासवर्ड रीसेट करने के लिए कृपया अपना ईमेल दर्ज करें।
ta: உங்கள் கடவுச்சொல்லை மீட்டமைக்க உங்கள் மின்னஞ்சலை உள்ளிடவும்.
